# Analyzing borrowers’ risk of defaulting¶
Your project is to prepare a report for a bank’s loan division. You’ll need to find out if a customer’s marital status and number of children has an impact on whether they will default on a loan. The bank already has some data on customers’ credit worthiness.

Your report will be considered when building a credit scoring of a potential customer. A ** credit scoring ** is used to evaluate the ability of a potential borrower to repay their loan.

### Step 1. Open the data file and have a look at the general information.

In [560]:
import pandas as pd

data_loan = pd.read_csv('credit_scoring_eng.csv')

In [561]:
data_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [562]:
data_loan.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

### Conclusion

Let's look through the DataFrame table and do some marks.<br>
1. There are 12 columns:
    - 7 of them are numbers
    - 4 of them are strings;
    - 1 of them boolean like ('M' or 'F'), although in our DataFrame it has type string.
2. All numbers are stored as 'int' or 'float' types but for 'string'.
3. For some reason "days_employed" has negative numbers **need to do something**; <br>
    **QUESTION** Why does "days_employed" is a 'float' rather than 'int' (maybe it includes hours);
4. 'education' recorded with low&CAPS letters **need to do something**
5. There are null-values in "*days_employed", "total_income"* **need to do something**
6. It is better change some name of columns **need to do something**

In [563]:
name_columns_new = ['children', 'days_employed', 'age', 'education', 'education_id', 
                    'family_status', 'family_status_id', 'gender', 'income_type', 
                    'dept', 'income', 'purpose']
data_loan.set_axis(name_columns_new, axis = 'columns', inplace = True)

In [564]:
data_loan.head(2)

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase

### Step 2. Data preprocessing

**I want to add income category**

In [565]:
print('mean',data_loan['income'].mean())
print('max',data_loan['income'].max())
print('min',data_loan['income'].min())
def fun_income_category(row):
    pay = row['income']
    if pay < 10000:
        return 'Poor'
    elif pay < 20000:
        return 'Low Average'
    elif pay < 30000:
        return 'Average'
    elif pay < 40000:
        return 'High Average'
    elif pay < 50000:
        return 'Rich'
    elif not(pd.isnull(pay)):
        return 'Luxury'
    return

mean 26787.56835465871
max 362496.645
min 3306.762

In [566]:
data_loan['income_category'] = data_loan.apply(fun_income_category, axis=1)

In [567]:
data_loan.head()

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,Rich
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,Low Average
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house,Average
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,Rich
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,Average

In [568]:
data_loan['income_category'].value_counts()

Low Average     6443
Average         6063
High Average    3107
Rich            1492
Luxury          1320
Poor             926
Name: income_category, dtype: int64

**I want to add age category**

In [569]:
#data_loan.groupby('age')['income'].mean()
def fun_age_category(row):
    age = row['age']
    if age < 23:
        return 'Forever young'
    elif age < 50:
        return 'Young'
    elif age < 65:
        return 'Sapient'
    else:
        return 'Master Yoda'

In [570]:
data_loan['age_category'] = data_loan.apply(fun_age_category, axis=1)

In [571]:
data_loan['age_category'].value_counts().sort_values()

Forever young      460
Master Yoda        899
Sapient           6297
Young            13869
Name: age_category, dtype: int64

---------------------------------------------------------------------------------------
##### 2а.Step-by-step. 1st column 'children'
BRIEFLY: I found '-1' and '20' values which were errrors and replaced them by '0'. <br>
REASONs: 1) not many of these values; 2) '0' is a mean and median, 3) '0' is a carefull estimation to give a credit.

In [572]:
# find unique values
data_loan['children'].unique()

array([ 1,  0,  3,  2, -1,  4, 20,  5], dtype=int64)

#### Mini-Conclusion 1:
There are impossible "-1" and unbelivable "20" values. <br>
I can check "20".
- how many of them?
- let's see "age" and understand if it is possible or not

In [573]:
print("20 children in:",data_loan[data_loan['children'] == 20]['children'].count(), "rows")
print("-1 children in:",data_loan[data_loan['children'] == -1]['children'].count(), "rows")

20 children in: 76 rows
-1 children in: 47 rows

In [574]:
data_loan[data_loan['children'] == 20].head(5)

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
606,20,-880.221113,21,secondary education,1,married,0,M,business,0,23253.578,purchase of the house,Average,Forever young
720,20,-855.595512,44,secondary education,1,married,0,F,business,0,18079.798,buy real estate,Low Average,Young
1074,20,-3310.411598,56,secondary education,1,married,0,F,employee,1,36722.966,getting an education,High Average,Sapient
2510,20,-2714.161249,59,bachelor's degree,0,widow / widower,2,F,employee,0,42315.974,transactions with commercial real estate,Rich,Sapient
2941,20,-2161.591519,0,secondary education,1,married,0,F,employee,0,31958.391,to buy a car,High Average,Forever young

#### Mini-Conclusion 2:
Unbelievable that somebody in 20-years old can have 20 children. So it is an error. <br>
76 + 47 rows from 21525 is only a 0.57% of data. In fact I can just remove this data from data sample. But I want to train how to replace these values with some mean value.

In [575]:
print("Average of children of who is married: {:.2f}".format(data_loan[(data_loan['family_status'] == 'married') 
        & (data_loan['children'] != 20 ) & (data_loan['children'] != -1)]['children'].mean()))
# exceptional values are excluded

Average of children of who is married: 0.56

#### Mini-Conclusion 3:
Better solution! In the average even besides of people who are in a marriage has 0.56 children, median is 0. So,
1) I can replace it by mean-value 0;
2) I think it is worse to give a loan which is not returned back. So 0-value-replace is a reasonable careful solution

In [576]:
# replace '-1' and '20' with '0'
data_loan.loc[(data_loan['children'] == 20 ) | (data_loan['children'] == -1),'children'] = 0

In [577]:
data_loan['children'].unique()

array([1, 0, 3, 2, 4, 5], dtype=int64)

**Success!**

---------------------------------------------------------------------------------------
##### 2c.Step-by-step. 4th column 'education'
(before do 3rd column, need to do this one) <br>
BRIEFLY: I used lowercase to the strings in 'education' <br>
REASONs: I wanted lead all this names to one kind.

In [578]:
data_loan['education'] = data_loan['education'].str.lower()

In [579]:
data_loan['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

**Perfect!!!**

---------------------------------------------------------------------------------------
##### 2d.Step-by-step. 3rd column 'age'
BRIEFLY: I replaced 0-value in age by mean value in each of educational group <br>
REASONs: I think that age and education should has a good correlation especially for young people. Remember that the number of this values is too small 101 from 21525. <br>
COMMENT: I really didn't like the way I did it. For some reasons the below code doesn't work <br>
data_loan.loc[data_loan['age'] == 0,'age'] = data_age_zero (I applyed astype of course)

In [580]:
data_loan['age'].unique()

array([42, 36, 33, 32, 53, 27, 43, 50, 35, 41, 40, 65, 54, 56, 26, 48, 24,
       21, 57, 67, 28, 63, 62, 47, 34, 68, 25, 31, 30, 20, 49, 37, 45, 61,
       64, 44, 52, 46, 23, 38, 39, 51,  0, 59, 29, 60, 55, 58, 71, 22, 73,
       66, 69, 19, 72, 70, 74, 75], dtype=int64)

In [581]:
# I see here "0" values; let's see how many of them
data_loan[data_loan['age'] == 0]['age'].count()

101

**Mini-Conclusion 6**: (1) Not many, (2) can use graduate to replace these values.

In [582]:
# I calculate mean with this zeros, but there are not so many 0-values, it wouldn't be a big errror
data_loan_group_education = data_loan.groupby('education')['age'].mean()

In [583]:
data_loan_group_education

education
bachelor's degree      40.668061
graduate degree        51.166667
primary education      47.691489
secondary education    44.536992
some college           34.661290
Name: age, dtype: float64

In [584]:
data_age_zero = data_loan_group_education[data_loan[data_loan['age'] == 0]['education']]

In [585]:
def update_age(row):
    age = row['age']
    education = row['education']
    
    if age != 0:
        return age
    else:
        if education == "bachelor's degree":
            return 41
        elif education == "graduate degree":
            return 51
        elif education == "primary education":
            return 47
        elif education == "secondary education":
            return 45
        elif education == "some college":
            return 35

In [586]:
data_loan['age'] = data_loan.apply(update_age, axis=1)

In [587]:
data_loan[data_loan['age'] == 0]['age'].count()

0

In [588]:
type(data_age_zero)

pandas.core.series.Series

---------------------------------------------------------------------------------------
##### 2e.Step-by-step. 5rd column 'education_id'
BRIEFLY: Nothing to do. It was OK. <br>
REASONs:  <br>

In [589]:
data_age_zero

education
secondary education    44.536992
secondary education    44.536992
secondary education    44.536992
secondary education    44.536992
bachelor's degree      40.668061
                         ...
secondary education    44.536992
secondary education    44.536992
secondary education    44.536992
bachelor's degree      40.668061
secondary education    44.536992
Name: age, Length: 101, dtype: float64

In [590]:
data_loan['education_id'].unique()

array([0, 1, 2, 3, 4], dtype=int64)

In [591]:
data_loan.groupby('education')['education_id'].mean().sort_values()

education
bachelor's degree      0
secondary education    1
some college           2
primary education      3
graduate degree        4
Name: education_id, dtype: int64

---------------------------------------------------------------------------------------
##### 2f.Step-by-step. 6nd column 'family_status'
BRIEFLY: I could combine 'divorced' with 'married' but I didn't do it. 'widow / widower' can't due to this group is to differ from other groups. <br>
REASONs: I want to make some analysis with each group. If necessary I will combine them. <br>

In [592]:
data_loan['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [593]:
data_loan['family_status'].value_counts()

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

**Comment:** One can combine "divorced" and "widow / widower" with some groups, because they are too small. BUT it is necessary to understand what kind of group is the closest. For example, by total income or age.

In [594]:
# groupby total income
data_loan.groupby('family_status')['income'].mean()

family_status
civil partnership    26694.428597
divorced             27189.354550
married              27041.784689
unmarried            26934.069805
widow / widower      22984.208556
Name: income, dtype: float64

In [595]:
# groupby age
data_loan.groupby('family_status')['age'].mean()

family_status
civil partnership    42.346181
divorced             45.877824
married              43.738611
unmarried            38.611091
widow / widower      56.743750
Name: age, dtype: float64

In [596]:
# groupby age
data_loan.groupby('family_status')['dept'].mean()

family_status
civil partnership    0.092890
divorced             0.071130
married              0.075202
unmarried            0.097405
widow / widower      0.065625
Name: dept, dtype: float64

**Mini-Conclusion 7:** "widow / widower" differ form other groups extremly. So I can't combine it with other groups. What about 'divorced'.. it is possible from my opinion to combine it with 'married'. I will do it later maybe.

---------------------------------------------------------------------------------------
##### 2g.Step-by-step. 7nd column 'family_status_id'
BRIEFLY: Nothing to do. It is OK <br>
REASONs:  <br>

In [597]:
data_loan['family_status_id'].unique()

array([0, 1, 2, 3, 4], dtype=int64)

In [598]:
data_loan.groupby('family_status')['family_status_id'].mean().sort_values()

family_status
married              0
civil partnership    1
widow / widower      2
divorced             3
unmarried            4
Name: family_status_id, dtype: int64

---------------------------------------------------------------------------------------
##### 2h.Step-by-step. 8th column 'gender'
BRIEFLY: I found one missing value and changed it with "F" value <br>
REASONs: Number of women twice greater than men <br>

In [599]:
# is there missing values?
data_loan['gender'].unique()

array(['F', 'M', 'XNA'], dtype=object)

In [600]:
data_loan['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [601]:
# only one row with missing value, let's check it
data_loan[data_loan['gender'] == 'XNA']

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
10701,0,-2358.600502,24,some college,2,civil partnership,1,XNA,business,0,32624.825,buy real estate,High Average,Young

In [602]:
# IT is more likely that it is a female because number of females twice greater than males. So
data_loan.loc[data_loan['gender'] == 'XNA','gender'] = 'F'

In [603]:
data_loan['gender'].value_counts()

F    14237
M     7288
Name: gender, dtype: int64

**!Great**

---------------------------------------------------------------------------------------
##### 2i.Step-by-step. 9th column 'income type'
BRIEFLY: I see that there are 4 groups with extremely low data in it. But I don't understand what can I do. Combine? But for what reason? <br>
REASONs:  <br>

In [604]:
data_loan['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

In [605]:
# let's see in detail each of group
# number of last of them are so few
data_loan[data_loan['income_type'] == 'entrepreneur']

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
5936,0,NaN,58,bachelor's degree,0,married,0,M,entrepreneur,0,NaN,buy residential real estate,None,Sapient
18697,0,-520.848083,27,bachelor's degree,0,civil partnership,1,F,entrepreneur,0,79866.103,having a wedding,Luxury,Young

In [606]:
data_loan[data_loan['income_type'] == 'unemployed']

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
3133,1,337524.466835,31,secondary education,1,married,0,M,unemployed,1,9593.119,buying property for renting out,Poor,Young
14798,0,395302.838654,45,bachelor's degree,0,civil partnership,1,F,unemployed,0,32435.602,housing renovation,High Average,Young

In [607]:
data_loan[data_loan['income_type'] == 'student']

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
9410,0,-578.751554,22,bachelor's degree,0,unmarried,4,M,student,0,15712.26,construction of own property,Low Average,Forever young

In [608]:
data_loan[data_loan['income_type'] == 'paternity / maternity leave']

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category
20845,2,-3296.759962,39,secondary education,1,married,0,F,paternity / maternity leave,1,8612.661,car,Poor,Young

---------------------------------------------------------------------------------------
##### 2k.Step-by-step. 10th column 'dept'
BRIEFLY: Nothing to do. It is OK <br>
REASONs:  <br>

In [609]:
data_loan['dept'].value_counts()

0    19784
1     1741
Name: dept, dtype: int64

---------------------------------------------------------------------------------------
##### 2l.Step-by-step. 11th column 'income'
BRIEFLY: I add NA with average income based on grouping by age. BUT if it were my money I never gave a loan to a person without information about his income. So... It isn't a good idea to give this credit to such a person. I think in real life a remove all of this people from the data set. Especially if they ask too many. <br>
REASONs:  <br>

In [610]:
print(data_loan['income'].count(), '<', data_loan.shape[0])

19351 < 21525

In [611]:
data_loan.groupby('age_category')['income'].mean()

age_category
Forever young    22768.635545
Master Yoda      21542.650450
Sapient          25313.124503
Young            27923.797357
Name: income, dtype: float64

In [612]:
def income_update(row):
    pay = row['income']
    age = row['age_category']
    
    if not(pd.isnull(pay)):
        return pay
    elif age == 'Forever young':
        return 22034.50
    elif age == 'Master Yoda':
        return 21542.65
    elif age == 'Sapient':
        return 25313.12
    elif age == 'Young':
        return 27905.09

In [613]:
data_loan['income'] = data_loan.apply(income_update, axis=1)
data_loan['income_category'] = data_loan.apply(fun_income_category, axis=1)

In [614]:
print(data_loan['income'].count(), '<', data_loan.shape[0])

21525 < 21525

---------------------------------------------------------------------------------------
##### 2b.Step-by-step. 2nd column 'days_employed'
BRIEFLY: I did something useless. I removed all positive values, then changed all negative values to positive and eventually fillNA values with averaged values which I found by grouping 'income_category'. <br>
REASONs: 'days_employed' doesn't influence on my study; but I like when things in order.

**Q1**: How many negative numbers in **"days_employed"**? If there is only a few of them it could be a human error.

In [615]:
print("Negative numbers in <days_employed>:",data_loan[data_loan['days_employed'] < 0]['days_employed'].count(),
     "from", data_loan.shape[0])
print("Zeroes numbers in <days_employed>:",data_loan[data_loan['days_employed'] == 0]['days_employed'].count(),
     "from", data_loan.shape[0])
print("Positive numbers in <days_employed>:",data_loan[data_loan['days_employed'] > 0]['days_employed'].count(),
     "from", data_loan.shape[0])

Negative numbers in <days_employed>: 15906 from 21525
Zeroes numbers in <days_employed>: 0 from 21525
Positive numbers in <days_employed>: 3445 from 21525

**Mini-Conclusion 4**: Most of the data in **"days_employed"** is negative. So, this is a system errors. <br>
**Q2**: Let's check positive numbers. Why do they positive? What's the peculiarity in them?

In [616]:
print("Minimal positive number in <days_employed>:", data_loan[data_loan['days_employed'] > 0]['days_employed'].min())
print("That is {:.2f} years".format(data_loan[data_loan['days_employed'] > 0]['days_employed'].min() / 365.))

print("Minimal negative number in <days_employed>:", data_loan[data_loan['days_employed'] < 0]['days_employed'].min())
print("That is {:.2f} years".format(data_loan[data_loan['days_employed'] < 0]['days_employed'].min() / 365.))

Minimal positive number in <days_employed>: 328728.72060451825
That is 900.63 years
Minimal negative number in <days_employed>: -18388.949900568383
That is -50.38 years

*900 years could be the truth if we want give the loan to Connor MacLeod (refer to Highlander) :) <br>*

In [617]:
print('Average age of people with positive <days_employed>: ',data_loan[data_loan['days_employed'] > 0]['age'].mean())
print('Average age of people with positive <days_employed>: ',data_loan[data_loan['days_employed'] < 0]['age'].mean())

Average age of people with positive <days_employed>:  59.342235123367196
Average age of people with positive <days_employed>:  40.01930089274487

In [618]:
print('Minimal age of people with positive <days_employed>: ',
      data_loan[(data_loan['days_employed'] > 0) & (data_loan['age'] != 0)]['age'].min())
print('He is employed for days/hours: ',
      data_loan[(data_loan['days_employed'] > 0) & (data_loan['age'] == 22)]['days_employed'])

Minimal age of people with positive <days_employed>:  22
He is employed for days/hours:  1242    334764.259831
Name: days_employed, dtype: float64

**Comment**: I thought, that this values are not days but hours. Unfortunately I was wrong. <br>
A person 22-years old can't have 334764 hours (38 years) in 'days_employed'

**Mini-Conclusion 5**: 'days_employed' is unnecessary. I just wand to replave positive numbers by average. And I change all negative numbers to positive.

In [619]:
data_loan.loc[data_loan['days_employed'] > 0, 'days_employed'] = float("nan")   #NaN
try:
    data_loan['days_employed'] = (-1)*data_loan['days_employed']
except:
    data_loan['days_employed'] = data_loan['days_employed']

In [620]:
data_loan.groupby('income_category')['days_employed'].mean().sort_values()

income_category
Low Average     2306.484980
High Average    2336.364951
Average         2342.983940
Poor            2368.292018
Rich            2465.783414
Luxury          2495.098411
Name: days_employed, dtype: float64

In [621]:
def update_days_employed(row):
    days_employed = row['days_employed']
    income_category = row['income_category']
    
    if not(pd.isnull(days_employed)):
        return int(days_employed)
    else:
        if income_category == "Low Average":
            return 2306.48
        elif income_category == "High Average":
            return 2336.36
        elif income_category == "Average":
            return 2342.98
        elif income_category == "Poor":
            return 2368.29
        elif income_category == "Rich":
            return 2465.78
        elif income_category == "Luxury":
            return 2495.09

In [622]:
data_loan['days_employed'] = data_loan.apply(update_days_employed, axis=1)

In [623]:
data_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     21525 non-null  float64
 2   age               21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   dept              21525 non-null  int64
 10  income            21525 non-null  float64
 11  purpose           21525 non-null  object
 12  income_category   21525 non-null  object
 13  age_category      21525 non-null  object
dtypes: float64(2), int64(5), object(7)
memory usage: 2.3+ MB

In [624]:
data_loan.loc[12,:]

children                              0
days_employed                   2342.98
age                                  65
education           secondary education
education_id                          1
family_status         civil partnership
family_status_id                      1
gender                                M
income_type                     retiree
dept                                  0
income                          21542.7
purpose               to have a wedding
income_category                 Average
age_category                Master Yoda
Name: 12, dtype: object

---------------------------------------------------------------------------------------
##### 2m.Step-by-step. 12th column 'purpose'
BRIEFLY: This column is not OK. Many duplicates. <br>
REASONs:  <br>

In [625]:
data_loan.purpose.unique()

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

In [626]:
len(data_loan.purpose.unique())

38

**Mini-Conclusion 8:** There are several type of purpose: 'house', 'car', 'education', 'wedding'.

In [627]:
# import libraries
import nltk
from nltk.stem import WordNetLemmatizer
import pandas as pd
from collections import Counter

# WordNetLemmatizer 
dictionary_extended = ['house', 'car', 'education', 'wedding', 'property', 'house','estate','housing','university', 'cars', 'educated']
purpose_category = []
for goals in data_loan['purpose']:
    wordnet_lemma = WordNetLemmatizer()
    
    words = nltk.word_tokenize(goals)
    lemmas = [wordnet_lemma.lemmatize(w, pos = 'n') for w in words]
    
    for item_dictionary in dictionary_extended:
        if item_dictionary in words:
            purpose_category.append(item_dictionary)
            break

In [628]:
# SnowballStemmer to cut number of categories
from nltk.stem import SnowballStemmer
english_stemmer = SnowballStemmer('english')

dictionary = ['hous','car','educ','wed']
sum = 0
for k, goals in enumerate(purpose_category):
    stemming = english_stemmer.stem(goals)
    if stemming in dictionary:
        sum += 1
        purpose_category[k] = stemming
    if (stemming == 'properti') | (stemming == 'estat'):
        sum += 1
        purpose_category[k] = 'hous'
    if stemming == 'univers':
        sum += 1
        purpose_category[k] = 'educ'

In [629]:
data_loan['purpose_category'] = purpose_category

### Not excellent: half-automatization in this solution.

# Conclusion of Step 2.

1. I have replaced all miss- and extraordinary values
2. I have added some useful category-columns

It has been a preprocessing of data.

In [630]:
data_loan.head(10)

,children,days_employed,age,education,education_id,family_status,family_status_id,gender,income_type,dept,income,purpose,income_category,age_category,purpose_category
0,1,8437.00,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,Rich,Young,hous
1,1,4024.00,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,Low Average,Young,car
2,0,5623.00,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,Average,Young,hous
3,3,4124.00,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,Rich,Young,educ
4,0,2342.98,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,Average,Sapient,wed
5,0,926.00,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,Rich,Young,hous
6,0,2879.00,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,High Average,Young,hous
7,0,152.00,50,secondary education,1,married,0,M,employee,0,21731.829,education,Average,Sapient,educ
8,2,6929.00,35,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,Low Average,Young,wed
9,0,2188.00,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,Average,Young,hous

In [631]:
data_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     21525 non-null  float64
 2   age               21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   dept              21525 non-null  int64
 10  income            21525 non-null  float64
 11  purpose           21525 non-null  object
 12  income_category   21525 non-null  object
 13  age_category      21525 non-null  object
 14  purpose_category  21525 non-null  object
dtypes: float64(2), int64(5), object(8)
memory usage: 2.5+ MB

### Step 3. Answer these questions:
- Is there a connection between having kids and repaying a loan on time?
- Is there a connection between marital status and repaying a loan on time?
- Is there a connection between income level and repaying a loan on time?
- How do different loan purposes affect timely loan repayment?
Interpret your answers. Explain what the results you obtained mean.

In [638]:
# let's see how many people with different number of children
data_loan.groupby('children')['dept'].count()

children
0    14272
1     4818
2     2055
3      330
4       41
5        9
Name: dept, dtype: int64

In [642]:
# Because number of people with 5 children is so small, we can combine them with '2', '3' and '4'
def children_category(row):
    num_child = row['children']
    if num_child == 0:
        return 'Free'
    elif num_child == 1:
        return 'Child'
    else:
        return 'Large_family'
    
data_loan['children_category'] = data_loan.apply(children_category, axis=1)

In [643]:
data_loan.groupby('children_category')['dept'].count()

children_category
Child            4818
Free            14272
Large_family     2435
Name: dept, dtype: int64

In [644]:
# let's see how many 'depts' there are
# here mean is a ratio of this value in each group
data_loan.groupby('children_category')['dept'].mean()

children_category
Child           0.092154
Free            0.075112
Large_family    0.092402
Name: dept, dtype: float64

#### Answer:
1. number of children slightly inflence on a repaying a loan on time. Although (it was unexpected for me) people without children more likely repaying a loan on time.

In [654]:
# let's see how many people with different number of children
data_loan.groupby('family_status')['dept'].count()

family_status
civil partnership     4177
divorced              1195
married              12380
unmarried             2813
widow / widower        960
Name: dept, dtype: int64

In [656]:
data_loan.groupby('family_status')['dept'].mean().sort_values()

family_status
widow / widower      0.065625
divorced             0.071130
married              0.075202
civil partnership    0.092890
unmarried            0.097405
Name: dept, dtype: float64

#### Answer:
2. Better give a loan to widow/widower, divorced, married. Worse to civil partnership and unmarried

In [658]:
# let's see how many people with different number of children
data_loan.groupby('income_category')['dept'].mean()

income_category
Average         0.084618
High Average    0.077889
Low Average     0.085364
Luxury          0.069697
Poor            0.062635
Rich            0.068365
Name: dept, dtype: float64

In [659]:
data_loan.groupby('income_category')['dept'].count()

income_category
Average         8237
High Average    3107
Low Average     6443
Luxury          1320
Poor             926
Rich            1492
Name: dept, dtype: int64

#### Answer:
3. Suddenly poor's as well as rich's and luxury are repaying a loan on time in compare with average's.
Poor = [0, 10000]; Rich and Luxury = [40000, ...]
Average's = [10 000. 40000]. But there are more average's than the rest.

In [660]:
data_loan.groupby('purpose_category')['dept'].count()

purpose_category
car      4315
educ     4022
hous    10840
wed      2348
Name: dept, dtype: int64

In [661]:
data_loan.groupby('purpose_category')['dept'].mean()

purpose_category
car     0.093395
educ    0.091994
hous    0.072140
wed     0.079216
Name: dept, dtype: float64

#### Answer:
4. Depts are more often in 'car' and 'education' categories. I think the main reason is that 'house' is too expensive and people are more conscious when take a credit. Wedding credit is not so huge as educational and car's ones.

### Step 4. Overall conclusion
1. As I see 'purpose' and 'income_category' have a strong connection with repaying loan on time. <br>
Below the pivot table of this categories.
2. The best way to have a returned credit on time is to give it to (Poor, Rich, Luxury) who is not in marriage to buy a house.
3. The worse way is to give a loan for 'car' to a person with children with high-average income. Frankly say, this conclusion totaly against my view.

In [674]:
data_pivot = data_loan.pivot_table(index=['income_category', 'family_status'], columns='purpose_category', 
                                                                        values='dept', aggfunc='mean')

In [675]:
data_pivot

purpose_category                        car      educ      hous       wed
income_category family_status
Average         civil partnership  0.122699  0.136054  0.101781  0.084650
                divorced           0.094340  0.043956  0.078189       NaN
                married            0.080426  0.087584  0.071562       NaN
                unmarried          0.142857  0.100457  0.084127       NaN
                widow / widower    0.114943  0.070588  0.085106       NaN
High Average    civil partnership  0.115942  0.096774  0.066667  0.064140
                divorced           0.065217  0.107143  0.052632       NaN
                married            0.068720  0.077586  0.076389       NaN
                unmarried          0.170455  0.089744  0.096491       NaN
                widow / widower    0.071429  0.040000  0.057971       NaN
Low Average     civil partnership  0.129771  0.217742  0.096774  0.096336
                divorced           0.075949  0.080460  0.075000       NaN
                married            0.085750  0.094164  0.069801       NaN
                unmarried          0.120000  0.117647  0.074946       NaN
                widow / widower    0.081081  0.095238  0.019512       NaN
Luxury          civil partnership  0.040000  0.160000  0.118644  0.052239
                divorced           0.058824  0.000000  0.061224       NaN
                married            0.091892  0.065476  0.054945       NaN
                unmarried          0.085714  0.041667  0.096154       NaN
                widow / widower    0.000000  0.000000  0.095238       NaN
Poor            civil partnership  0.111111  0.000000  0.028571  0.033708
                divorced           0.100000  0.000000  0.043478       NaN
                married            0.099174  0.040323  0.067901       NaN
                unmarried          0.062500  0.153846  0.070175       NaN
                widow / widower    0.086957  0.066667  0.030303       NaN
Rich            civil partnership  0.107143  0.107143  0.083333  0.050314
                divorced           0.000000  0.230769  0.063830       NaN
                married            0.104712  0.064706  0.052529       NaN
                unmarried          0.050000  0.140351  0.054054       NaN
                widow / widower    0.066667  0.111111  0.037037       NaN